#7강 변수
#변수 = 저장 할 데이타
#number1 = 100

#변수규칙 1
#변수는 문자 숫자 _ 만 사용가능 함
#숫자가 먼저 나오면 안됨
#number1 (o) 1number (x) number_1(o) number^^(x)
#한글 변수 사용씨 오류가 발생할수 있음 대부분의 프로그래밍 언어를 영어변수 사용

#변수규칙 2
#예약어 사용 (x)
#중요한 이름은 파이썬이 사용

#변수규칙 3
#의미있는 이름
#color_name = '빨강'
#뜻을 짐작할수있는 이름으로 하는것이 좋다.

#변수 주의사항
#대문자 소문자 구별
#name 과 NAME 은 다른변수

# 띄어쓰기, 들여쓰기 
# 띄어쓰기, 들여쓰기 주의
# 변수이름의 띄어쓰기 안됨

#연습문제
#1 o  (o)
#2. frui t --> fruit = '사과' x (o)
#3. animal* --> animal = '개' x (o)
#4. 31_icecream = 3 --> icecream = 3 x (o)
#4. if = 100 --> x  *if_name (*)


